可能，是命运的安排，让我们自愿走上了这条艰难的道路，然后，在这条布满荆棘的曲折小路上慢慢去寻找人生的乐趣。然而，此时，我才发现，真正美妙而有意义的人生，大概就从我坚定不移地追求自己梦想的时候，才正式开始。———— 《愿你历经千帆，归来仍是少年》

生命的本质是苦难的。我不追求天赐荣华富贵，那会让我诚惶诚恐，消受不起，只是觉得，每天睁开眼睛发现自己还活着，没有缺胳膊少腿，还可以通过自己的努力和命运的黑色幽默较量搏斗，还可以勇敢的有尊严地与困难较量，这种感觉很踏实。———— 《愿你历经千帆，归来仍是少年》

求人不如求己。

绝望之后还要自己站起来<br>没人会帮你<br>这就是人生 -- yiny

心系梦想，童心未泯。不忘童真，方得美好。 ———— 致六一

创意驱动科技改变世界。-- yiny

学习本身是枯燥的，但如果变成你要学，而不是要你学，那就变成了一件非常快乐的事情。-- yiny

生活就是这么变化多端，我们无法改变这个与我们小时候所认识的不同的世界，但可以做到不让这个世界改变我们。每个人生来都是孤独的，在生活之中，我们有的人会变的不孤独，有的人会享受这份孤独，每个人都有自己的人生，孤独与否，全看你自己。-- 网易云用户

生活本就是重复的，但是有了身边的许许多多有趣的人，为无聊又单一的生活增添了色彩。 -- yiny